{
    "en": {
        "lang": "English",
        "pressButton": "Press any button to continue",
        "start": "Start Game",
        "difficulty": "Difficulty",
        "easy": "Easy",
        "medium": "Medium",
        "hard": "Hard",
        "settings": "Settings",
        "highScore": "High score: {score}",
        "sound": "Sound",
        "language": "Language",
        "back": "Back",
        "health": "HP / {value}",
        "money": "Gold: {value}",
        "continue": "Continue",
        "before": "Back",
        "skip": "Skip tutorial \n (hold)",
        "tutorial1": "Welcome court musician, your services are needed now more than ever.",
        "tutorial2": "The kingdom is being devastated by evil forces, which have a very particular weakness...",
        "tutorial3": "Music! which confuses the monsters and makes them stop attacking.",
        "tutorial4": "Your mission is to face these enemies with a melody to persuade them to stop attacking.",
        "tutorial5": "To achieve this you must defend yourself from their attacks by identifying their direction and counterattacking at the precise moment.",
        "tutorial6": "If you receive an attack from the enemy it will damage you and if your vitality is reduced to 0 you will be defeated.",
        "tutorial7": "To defeat the enemy you must survive their attacks for the duration of your song.",
        "tutorial8": "Use the gold you find on your adventure to acquire new equipment from a merchant, take these 10 gold coins for your journey.",
        "tutorial9": "I must also warn you that as you progress you will encounter stronger enemies that will attack fiercely and will require longer time to surrender.",
        "tutorial10": "Your performance will be measured according to your hits and how many enemies you defeat.",
        "tutorial11": "Good luck, court musician and may your battle song sound proudly over our enemies.",
        "tutorialAttack": "These are the attack indicators, press the correct direction when the color touches the indicator to defend yourself.",
        "tutorialHealth": "This is the health bar, if you fail a defense you will recive damage and your health points (HP) will decrease, when the bar reaches 0 HP you are defeated.",
        "tutorialTime": "This is the time bar, as the combat progresses the bar will fill, when full the combat ends.",
        "tutorialMoney": "This is your gold, you will recive gold when the combat finishes, use it to buy items in the store.",
        "tutorialScore": "This is your score, as you defend correctly of an attack you will recive score points, try to get the highest score possible!",
        "gameOver": "Game Over",
        "victory": "Enemy defeated",
        "tips": "The creature leaves you a tip of {value} gold!",
        "store": "Store",
        "buy": "Buy",
        "exit": "Exit",
        "bought": "You bought {value}!",
        "cantBuy": "You don't have enough gold",
        "potion": "Potion (30HP)",
        "exitShop": "Exit the shop?",
        "no": "No",
        "yes": "Yes"
    },
    "es": {
        "lang": "Español",
        "pressButton": "Presiona cualquier botón para continuar",
        "start": "Iniciar Juego",
        "difficulty": "Dificultad",
        "easy": "Facil",
        "medium": "Intermedio",
        "hard": "Dificil",
        "settings": "Opciones",
        "highScore": "Puntuación más alta: {score}",
        "sound": "Sonido",
        "language": "Idioma",
        "back": "Atrás",
        "health": "PS / {value}",
        "money": "Oro: {value}",
        "continue": "Continuar",
        "before": "Atras",
        "skip": "Saltar tutorial \n (mantener)",
        "tutorial1": "Bienvenido músico de la corte, tus servicios son necesitados hoy más que nunca.",
        "tutorial2": "El reino esta siendo devastado por fuerzas malvadas, las cuales poseen una debilidad muy particular...",
        "tutorial3": "La música! la cual confunde a los mounstruos y hace que dejen de atacar.",
        "tutorial4": "Tu misión es enfrentarte a estos enemigos y tocar una melodía para persuadirlos a dejar de atacar.",
        "tutorial5": "Para lograrlo deberás defenderte de sus ataques identificando su direccion y contratacar en el instante exacto.",
        "tutorial6": "Si recibes un ataque del enemigo te dañará y si tu vitalidad es reducida a 0 serás derrotado.",
        "tutorial7": "Para derrotar al enemigo debes sobrevivir sus ataques por la duración de tu canción.",
        "tutorial8": "Utiliza el oro que encuentres en tu aventura para adquirir nuevo equipamiento de un mercader, toma estas 10 monedas oro para tu viaje.",
        "tutorial9": "Además debo advertirte que a medida que avances te encontrarás con enemigos más fuertes que atacarán ferozmente y requerirán un mayor tiempo para rendirse.",
        "tutorial10": "Tu desempeño será medido de acuerdo a tus aciertos y cuantos enemigos derrotes.",
        "tutorial11": "Buena suerte, músico de la corte y que tu música de batalla suene orgullosamente sobre nuestros enemigos.",
        "tutorialAttack": "Estos son los indicadores de ataque, presiona la dirección adecuada cuando el color toca el indicador para defenderte correctamente.",
        "tutorialHealth": "Esta es tu barra de vida, si fallas la defensa recibirás daño y bajarán tus puntos de salud (PS), al llegar a 0 PS eres derrotado.",
        "tutorialTime": "Esta es la barra de tiempo, a medida que avance el combate se llenará, al completarse termina el combate.",
        "tutorialMoney": "Este es tu oro, recibirás oro al terminar un combate, utilízalo para comprar objetos en la tienda.",
        "tutorialScore": "Esta es tu puntuación, al defenderte correctamente de un ataque recibirás puntos ¡intenta conseguir la mayor cantidad de puntos posibles!",
        "gameOver": "Fin del juego",
        "victory": "Enemigo derrotado",
        "tips": "La criatura te deja una propina de {value} de oro!",
        "store": "Tienda",
        "buy": "Comprar",
        "exit": "Salir",
        "bought": "Compraste {value}!",
        "cantBuy": "No tienes suficiente oro",
        "potion": "Poción (30PS)",
        "exitShop": "Salir de la tienda?",
        "no": "No",
        "yes": "Sí"
    }
}